/*
Navicat Oracle Data Transfer
Oracle Client Version : 10.2.0.5.0

Source Server         : ai
Source Server Version : 110200
Source Host           : 127.0.0.1:1521
Source Schema         : AI

Target Server Type    : ORACLE
Target Server Version : 110200
File Encoding         : 65001

Date: 2015-04-13 13:54:30
*/


-- ----------------------------
-- Table structure for ALM_REQUISITION
-- ----------------------------
DROP TABLE "AI"."ALM_REQUISITION";
CREATE TABLE "AI"."ALM_REQUISITION" (
"REQ_ID" NUMBER(12) NOT NULL ,
"REQ_TAG" VARCHAR2(50 BYTE) NOT NULL ,
"REQ_NAME" VARCHAR2(400 BYTE) NOT NULL ,
"REQ_ABSTRACT" VARCHAR2(32 BYTE) NULL ,
"REQ_DESC" VARCHAR2(4000 BYTE) NOT NULL ,
"REQ_TYPE" NUMBER(2) DEFAULT 1  NOT NULL ,
"SYS_TAG" NUMBER(2) NULL ,
"SUBSYS_TAG" NUMBER(2) NULL ,
"PREDICT_WORKLOAD" NUMBER(4) NULL ,
"CREATE_TIME" DATE NULL ,
"PLAN_TIME" DATE NULL ,
"CUR_PHASE" NUMBER(4) NULL ,
"CUR_STATUS" NUMBER(4) NULL ,
"STATUS_STEP" NUMBER(2) NULL ,
"ATT_PACK_ID" NUMBER(12) NULL 
)
LOGGING
NOCOMPRESS
NOCACHE

;
COMMENT ON TABLE "AI"."ALM_REQUISITION" IS '
需求来源：盟市、省业务部门、省业务支撑中心、集团公司、
紧急程度：一般、紧急
需求类型：新业务、新功能、系统缺陷、资费、数据修改、统计、经营分析系统、配置类、渠道、其它
业务受理渠道：无、10086热线、 WAP营业厅、短信营业厅、 网上营业厅、 自助终端
需求所属系统：BOSS、BI、客服、BOMC 等
需求所属子系统：每个系统应对应不同的子系统分类
完成状态：终止、部分完成、完成
需求所属模块：每个子系统对应不同的模块分类
';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."REQ_ID" IS '需求ID';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."REQ_TAG" IS '需求编号';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."REQ_NAME" IS '需求名称';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."REQ_ABSTRACT" IS '主题词';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."REQ_DESC" IS '需求描述';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."REQ_TYPE" IS '需求类型';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."SYS_TAG" IS '所属系统';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."SUBSYS_TAG" IS '子系统';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."PREDICT_WORKLOAD" IS '预估工作量';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."CREATE_TIME" IS '创建时间';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."PLAN_TIME" IS '计划完成时间';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."CUR_PHASE" IS '需求阶段';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."CUR_STATUS" IS '所处环节（=link_id)';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."STATUS_STEP" IS '当前环节所处的步骤（0=生成、1=已打单、2=完成）';
COMMENT ON COLUMN "AI"."ALM_REQUISITION"."ATT_PACK_ID" IS '附件包ID';

-- ----------------------------
-- Records of ALM_REQUISITION
-- ----------------------------
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3201', '0000SJ201407140055_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2014-12-23 10:46:31', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-02 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '118', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3301', '0000SJ2014071400345_2', '旧旧旧2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2015-01-04 09:16:32', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3302', '0000SJ2014071400456_2', '新新新2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2015-01-04 09:18:01', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3303', '0000SJ2014071400567_2', '切切切轻轻2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '53', '12', TO_DATE('2015-01-04 09:25:32', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-29 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '13', '116', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3305', '0000SJ2014071400111_2', '爸爸八佰伴2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2015-01-04 11:40:00', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-02-03 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '13', '116', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3161', '0000SJ201407140033_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '54', '1', TO_DATE('2014-12-16 14:58:03', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-30 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '111', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3162', '0000SJ201407140033_3', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '3', null, null, TO_DATE('2014-12-16 14:58:03', 'YYYY-MM-DD HH24:MI:SS'), null, '1', '2', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3163', '0000SJ201407140033_42', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '42', '50', '12', TO_DATE('2014-12-16 14:58:03', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-31 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '13', '224', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3282', '0000SJ2014071400234_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2015-01-03 20:32:01', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-29 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '13', '115', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3311', '0000SJ2014071400777_2', '呀呀呀呀呀呀2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '51', '12', TO_DATE('2015-01-04 16:52:55', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-04-09 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '11', '104', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3381', '0000SJ2014121002222_6', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '6', '50', '12', TO_DATE('2015-03-11 11:16:12', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-04-10 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '1', '7', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3382', '0000SJ2014121003333_42', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '42', '50', '12', TO_DATE('2015-03-11 11:19:32', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-04-01 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '11', '208', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3041', '0000SJ201408180047456_2', '关于开展“和通讯录注册同步有礼”活动的支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', '50', '12', TO_DATE('2014-11-24 16:00:03', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-04 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3042', '0000SJ201408180047456_3', '关于开展“和通讯录注册同步有礼”活动的支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '3', '50', '12', TO_DATE('2014-11-24 16:00:03', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-03 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3081', '0000SJ20140818004744_2', '关于开展支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', '50', '1', TO_DATE('2014-12-03 09:35:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-02 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3082', '0000SJ20140818004744_3', '关于开展支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '3', '50', '12', TO_DATE('2014-12-03 09:35:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-10 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3083', '0000SJ20140818004744_41', '关于开展支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '41', '50', '11', TO_DATE('2014-12-03 09:35:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-01 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3084', '0000SJ20140818004744_42', '关于开展支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '42', '50', '1', TO_DATE('2014-12-03 09:35:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-31 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3064', '0000SJ201408180047333_2', '关于开展“和通讯录注册同步有礼”活动的支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', '50', '123', TO_DATE('2014-11-25 19:19:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-04 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3061', '0000SJ201408180047111_2', '关于开展“和通讯录注册同步有礼”活动的支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', '50', '12', TO_DATE('2014-11-25 17:10:11', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-01 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '118', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3062', '0000SJ201408180047111_3', '关于开展“和通讯录注册同步有礼”活动的支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '3', null, null, TO_DATE('2014-11-25 17:10:11', 'YYYY-MM-DD HH24:MI:SS'), null, '1', '2', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3063', '0000SJ201408180047222_42', '关于开展“和通讯录注册同步有礼”活动的支撑需求', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '42', '51', '12', TO_DATE('2014-11-25 18:39:45', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-04 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3222', '0000SJ201407140077_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2014-12-24 16:28:54', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-30 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '110', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3121', '0000SJ201407140011_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2014-12-10 09:08:44', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3122', '0000SJ201407140011_3', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '3', null, null, TO_DATE('2014-12-10 09:08:44', 'YYYY-MM-DD HH24:MI:SS'), null, '1', '2', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3123', '0000SJ201407140011_41', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '41', null, null, TO_DATE('2014-12-10 09:24:51', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '201', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3241', '0000SJ201407140088_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2014-12-25 17:04:59', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3341', '0000SJ201412100124_2', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '2', '50', '12', TO_DATE('2015-01-22 14:47:20', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-02-06 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '11', '104', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3342', '0000SJ201412100124_3', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '3', null, null, TO_DATE('2015-01-22 14:47:20', 'YYYY-MM-DD HH24:MI:SS'), null, '1', '2', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3343', '0000SJ201412100124_41', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '41', null, null, TO_DATE('2015-01-22 14:47:20', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '201', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3344', '0000SJ201412100124_6', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '6', '50', '12', TO_DATE('2015-01-22 14:47:20', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-04-03 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '1', '7', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3101', '0000SJ20140818004766_2', '关于开展', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', null, null, TO_DATE('2014-12-08 10:52:50', 'YYYY-MM-DD HH24:MI:SS'), null, null, null, null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3102', '0000SJ20140818004766_3', '关于开展', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '3', '50', '12', TO_DATE('2014-12-08 10:52:50', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-29 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '1', '17', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3103', '0000SJ20140818004766_41', '关于开展', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '41', null, null, TO_DATE('2014-12-08 10:52:50', 'YYYY-MM-DD HH24:MI:SS'), null, null, null, null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3141', '0000SJ201407140022_41', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '41', '50', '12', TO_DATE('2014-12-11 16:01:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-17 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '14', '217', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3142', '0000SJ201407140022_42', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '42', '50', '12', TO_DATE('2014-12-11 16:01:19', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-31 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '13', '224', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3221', '0000SJ201407140066_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '5', '12', TO_DATE('2014-12-24 15:33:13', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2014-12-30 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '118', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3181', '0000SJ201407140044_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2014-12-22 16:59:38', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3310', '0000SJ2014071400666_2', '头疼头疼头疼2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2015-01-04 16:50:30', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-02-02 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '107', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3345', '0000SJ2014121001241_2', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '2', '50', '12', TO_DATE('2015-01-22 15:04:03', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-02-05 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '11', '105', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3346', '0000SJ2014121001241_3', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '3', null, null, TO_DATE('2015-01-22 15:04:03', 'YYYY-MM-DD HH24:MI:SS'), null, '1', '2', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3347', '0000SJ2014121001241_41', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '41', null, null, TO_DATE('2015-01-22 15:04:03', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '201', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3348', '0000SJ2014121001241_6', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '6', '50', '12', TO_DATE('2015-01-22 15:04:03', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-04-10 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '1', '7', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3104', '0000SJ20140818004777_2', '关于开展', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', '50', '1', TO_DATE('2014-12-08 11:29:23', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-02 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3105', '0000SJ20140818004788_2', '关于开展', null, '根据集团《2014年数据业务发展能力综合评估体系》要求，为进一步普及和通讯录业务，培养客户使用习惯，同步提升和通讯录业务普及率和活跃度，计划在全省各自有互联网渠道开展“和通讯录下载登陆有礼”营销活动，活动内容如下： 一、活动主题 和通讯录注册同步有礼营销活动 二、目标客户 新增和通信录注册客户，包括免费版与3元版 三、活动时间 2014年9月1日起至2014年12月31日 四、活动内容 下载并注册和通讯录客户端，且首次同步手机号码至和通信录服务器的客户，当月可立即获得30M省内手机上网流量奖励，同时立即获得5G WLAN随e行客量，获赠流量仅当月有效。', '1', '2', null, null, TO_DATE('2014-12-08 11:34:20', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '101', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3281', '0000SJ2014071400123_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2015-01-03 20:29:42', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3306', '0000SJ2014071400222_2', '惺惺惜惺惺2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2015-01-04 12:33:14', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-28 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '11', '104', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3361', '0000SJ2014121001111_2', '关于2015年数据两节线上渠道营销支撑需求', null, '为抓住两节业务发展的黄金时机，配合大市场做好两节促销，提升数据业务渗透率、活跃率及创收能力，根据两节期间客户对数据业务的需求，结合总部年度综合能力评估考核要求和新近部署的数字内容综合包月产品方案，开展数据业务两节促销线上集中运营活动。', '1', '2', '50', '12', TO_DATE('2015-01-29 14:17:40', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-02-06 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '12', '106', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3304', '0000SJ2014071400789_2', '啊啊啊啊啊啊2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2015-01-04 11:21:08', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-28 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '10', '102', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3261', '0000SJ201407140099_2', '2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '23', TO_DATE('2014-12-30 19:27:04', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-27 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '13', '116', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3308', '0000SJ2014071400444_2', '顶顶顶顶顶的2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', '50', '12', TO_DATE('2015-01-04 14:20:11', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-01-28 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3307', '0000SJ2014071400333_2', '惺惺惜惺惺2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2015-01-04 12:55:48', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3309', '0000SJ2014071400555_2', '鹅鹅鹅饿饿2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '2', null, null, TO_DATE('2015-01-04 14:30:30', 'YYYY-MM-DD HH24:MI:SS'), null, '10', '123', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3321', '0000SJ2014071400888_10', '呀呀呀呀呀呀2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '10', '50', '1222', TO_DATE('2015-01-14 18:08:09', 'YYYY-MM-DD HH24:MI:SS'), TO_DATE('2015-02-06 00:00:00', 'YYYY-MM-DD HH24:MI:SS'), '17', '221', null, null);
INSERT INTO "AI"."ALM_REQUISITION" VALUES ('3322', '0000SJ2014071400888_11', '呀呀呀呀呀呀2014年“七夕节”短信活动需求', null, '针对七夕情人节这个热点节日契机，进行情侣短信包促销宣传及在七夕当天开展免费发短信的优惠活动，达到“促活跃、增流量”目的。具体需求内容请见正文。', '1', '11', null, null, TO_DATE('2015-01-14 18:08:09', 'YYYY-MM-DD HH24:MI:SS'), null, '1', '2', null, null);

-- ----------------------------
-- Indexes structure for table ALM_REQUISITION
-- ----------------------------

-- ----------------------------
-- Checks structure for table ALM_REQUISITION
-- ----------------------------
ALTER TABLE "AI"."ALM_REQUISITION" ADD CHECK ("REQ_ID" IS NOT NULL);
ALTER TABLE "AI"."ALM_REQUISITION" ADD CHECK ("REQ_TAG" IS NOT NULL);
ALTER TABLE "AI"."ALM_REQUISITION" ADD CHECK ("REQ_NAME" IS NOT NULL);
ALTER TABLE "AI"."ALM_REQUISITION" ADD CHECK ("REQ_DESC" IS NOT NULL);
ALTER TABLE "AI"."ALM_REQUISITION" ADD CHECK ("REQ_TYPE" IS NOT NULL);

-- ----------------------------
-- Primary Key structure for table ALM_REQUISITION
-- ----------------------------
ALTER TABLE "AI"."ALM_REQUISITION" ADD PRIMARY KEY ("REQ_ID");
